data <- read.csv(file="C:\\Users\\ACER USER5949486\\Desktop\\CodeR\\data.csv")
# View(data)

# สถิติเชิงอนุมาน
# เราตั้งสมมุติฐานว่าถ้านิสิตที่ชอบรับประทานอาหาร ข้าว หรือ ก๋วยเตี๋ยว นั้นมีการใช้จ่ายรายวันอย่างน้อย 200 บาทใน 1วัน จึงทดสอบว่าสมมุติฐานเป็นจริงหรือไม่ที่ระดับนัยสำคัญ 0.05
# สมมุติฐานหลัก H0: mu >= 200 (นิสิตที่รับประทานอาหาร ข้าว หรือ ก๋วยเตี่ยว มีการใช้จ่ายจำนวนเงินอย่างน้อย 200 บาทใน 1 วัน)
# กำหนดให้ H1: mu < 200 (นิสิตที่รับประทานอาหาร ข้าว หรือ ก๋วยเตี่ยว มีการใช้จ่ายจำนวนเงินน้อยกว่า 200 บาทใน 1 วัน)
# xbar แทนจำนวนเงินโดยเฉลี่ยที่ใช้จ่ายรับประทานอาหารใน 1วัน
# mu แทนจำนวนเงินโดยเฉลี่ยที่ตั้งสมมุติฐานขึ้น
# กําหนดระดับนัยสําคัญ α = 0.05

# Compute Z-value
data1 <- as.numeric(data$Pay)
xbar <- mean(data$Pay)
mu <- 200
sigma <- sum(data1)
n <- nrow(data)
z <- (xbar - mu) / (sigma / sqrt(n))

z

# Compute Critical value
alpha <- .05
z.alpha <- qnorm(alpha)

# Compute p-value
p.value <- pnorm(z)
cat("p-value :" , pval)